{
  "project": "company_site_rag",
  "version": "v15",
  "updated_at": "2025-09-14",
  "chunks": [
    {
      "id": "openbanking_slide1_2",
      "source": "سين تربيع منتجات مصرفية مفتوحة.pdf",
      "page": "1-2",
      "section": "مقدمة / رؤية 2030",
      "lang": "ar",
      "text": "يعاني أغلب الموظفين اليوم من ضغوط مالية تؤثر على إنتاجيتهم، مع غياب أدوات عملية تساعدهم. هنا تأتي فكرة ريالك كحل يرفع الوعي المالي ويدعم الاستقرار الأسري. رؤية المملكة 2030: وطن طموح، اقتصاد حيوي، مجتمع مزدهر. ينسجم ريالك مع الرؤية عبر: - رفع وعي الفرد المالي - تعزيز ثقافة الادخار - دعم الاستقرار الأسري والإنتاجية",
      "tokens_est": 130
    },
    {
      "id": "openbanking_slide3_4",
      "source": "سين تربيع منتجات مصرفية مفتوحة.pdf",
      "page": "3-4",
      "section": "ما هو ريالك؟",
      "lang": "ar",
      "text": "ريالك تطبيق يستخدم علم النفس والسلوك والتقنية لتشجيع الادخار وبناء عادات مالية مستدامة. يهدف إلى خلق تجربة معاصرة وملهمة تتماشى مع أنماط الحياة الحديثة. يقدم بيئة عمل داخلية تشجيعية من خلال: - تحديات مخصصة - حوافز مرنة - محتوى توعوي",
      "tokens_est": 110
    },
    {
      "id": "openbanking_slide5_6",
      "source": "سين تربيع منتجات مصرفية مفتوحة.pdf",
      "page": "5-6",
      "section": "Open Banking Products",
      "lang": "en",
      "text": "E-Statement as a Service: Reduces the dependency on physical copies of documents. Credit Risk Assessment: Improves credit risk assessment and complements the credit scoring of Credit Bureaus. Letter of Guarantee as a Service: Digitizes the process of issuing guarantees. Transaction Data for SME Tax Filing: Streamlines tax filing for SMEs. Enterprise Financial Management: Provides aggregated balances, income/spending insights, and working capital utilization.",
      "tokens_est": 150
    },
    {
      "id": "openbanking_slide7_9",
      "source": "سين تربيع منتجات مصرفية مفتوحة.pdf",
      "page": "7-9",
      "section": "الأثر المستهدف",
      "lang": "ar",
      "text": "يسعى ريالك أن يكون نموذجًا وطنيًا يعزز كفاءة المنظومة المالية ويساهم في تحقيق أهداف رؤية 2030. الأثر المتوقع: - أثر داخلي: تحسين رفاه الموظفين واستقرارهم النفسي والمالي - أثر مؤسسي: تعزيز مكانة المؤسسة وتحقيق الاستدامة - أثر تجاري: تمكين عقود B2B وB2G",
      "tokens_est": 125
    },
    {
      "id": "openbanking_slide10_12",
      "source": "سين تربيع منتجات مصرفية مفتوحة.pdf",
      "page": "10-12",
      "section": "خارطة التنفيذ",
      "lang": "ar",
      "text": "خارطة التنفيذ المقترحة: - المرحلة الأولى: تصميم الهوية وإطلاق تجريبي داخلي - المرحلة الثانية: تشغيل داخلي لمدة 6 أشهر - المرحلة الثالثة: تقييم وتحسين مبني على نتائج الاستخدام - المرحلة الرابعة: توسعة داخلية أو تسويق خارجي",
      "tokens_est": 120
    },
    {
      "id": "openbanking_slide13_15",
      "source": "سين تربيع منتجات مصرفية مفتوحة.pdf",
      "page": "13-15",
      "section": "الخاتمة",
      "lang": "ar",
      "text": "ريالك ليس مجرد تطبيق، بل مبادرة وطنية تهدف إلى بناء جيل مالي واعٍ. من خلال التعاون مع الكليات، وزارة الموارد البشرية، والبنك المركزي، يتم تبنّي الحل كتجربة وطنية قابلة للتوسع. الهدف النهائي: رفع ثقافة التمكين المالي داخل بيئة العمل، والمساهمة في جودة الحياة.",
      "tokens_est": 115
    },
    {
      "id": "openbanking_intro_chunk1",
      "source": "المصرفية المفتوحة؟ تطبيق ريالك - ما هي .pdf",
      "page": "1",
      "section": "تعريف المصرفية المفتوحة",
      "lang": "ar",
      "text": "المصرفية المفتوحة تعني أنك تقدر تربط جميع حساباتك البنكية مع تطبيقات مرخصة من البنك المركزي السعودي (ساما) مثل تطبيق ريالك. النتيجة: - ربط الحسابات في مكان واحد آمن - تصنيف المصروفات تلقائيًا - توصيات مالية ذكية - بموافقتك فقط",
      "tokens_est": 120
    },
    {
      "id": "openbanking_intro_chunk2",
      "source": "المصرفية المفتوحة؟ تطبيق ريالك - ما هي .pdf",
      "page": "2",
      "section": "الفوائد اليومية",
      "lang": "ar",
      "text": "أبرز الفوائد اليومية: - نظرة موحدة لكل الحسابات البنكية - قرارات مالية أذكى - سيطرة مالية أكبر بعد الاطلاع على الدخل والمصروفات - صحة مالية أقوى بعد اكتشاف الهدر المالي",
      "tokens_est": 110
    },
    {
      "id": "openbanking_intro_chunk3",
      "source": "المصرفية المفتوحة؟ تطبيق ريالك - ما هي .pdf",
      "page": "3",
      "section": "الأمان",
      "lang": "ar",
      "text": "هل المصرفية المفتوحة آمنة؟ نعم وبشدة. ريالك يستخدم تقنيات تشفير متقدمة. - إشعارات عند دخول غير معروف - تحكم كامل بالصلاحيات - إلغاء الوصول متاح في أي وقت - جميع التطبيقات مرخصة من ساما وتعمل في أنظمة رسمية مشددة.",
      "tokens_est": 125
    },
    {
      "id": "xlab_overview_ar",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "XLAB – مختبر التقنية المالية (نظرة عامة)",
      "lang": "ar",
      "text": "إكس لاب (XLAB): مختبر التقنية المالية من سين تربيع يوفر بيئة اختبار آمنة ومرنة للشركات والمطورين لتطوير حلول مالية مبتكرة. يدعم محاكاة سيناريوهات مصرفية واقعية ببيانات صناعية آمنة ومتوافقًا مع رؤية 2030.",
      "tokens_est": 60
    },
    {
      "id": "xlab_features_ar",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "XLAB – المزايا الرئيسية",
      "lang": "ar",
      "text": "المزايا: اختبار آمن لسيناريوهات مصرفية؛ بنية تحتية قائمة على واجهات برمجة التطبيقات (AIS/PIS)؛ جاهزية الذكاء الاصطناعي لتطبيقات مثل كشف الاحتيال والتحليلات؛ رؤى مدفوعة بالبيانات عبر مجموعات بيانات غنية لدعم النمذجة وتحليل المخاطر.",
      "tokens_est": 80
    },
    {
      "id": "xlab_beneficiaries_ar",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "XLAB – المستفيدون",
      "lang": "ar",
      "text": "الفئات المستفيدة: المطورون وعلماء البيانات؛ شركات التقنية المالية الناشئة؛ البنوك والمؤسسات المالية؛ الهيئات التنظيمية والشركاء. الهدف: تسريع الابتكار في بيئة منظمة ومتوافقة.",
      "tokens_est": 60
    },
    {
      "id": "xhub_overview_ar",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "XHUB – مركز تجميع البيانات (نظرة عامة)",
      "lang": "ar",
      "text": "إكس هب (XHUB): منصة مركزية لتجميع البيانات عبر واجهات برمجة التطبيقات (APIs) تربط البنوك وشركات الفنتك والأعمال من خلال بوابة واحدة آمنة ومتوافقة مع معايير ساما. تمكّن وصولًا موحّدًا وسريعًا للبيانات المالية وتبسيطًا للتكامل مع عدة بنوك.",
      "tokens_est": 85
    },
    {
      "id": "xhub_services_ar",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "XHUB – الخدمات والخصائص",
      "lang": "ar",
      "text": "الخدمات: لوحة تحكم موحّدة لمتابعة الحسابات والتدفقات؛ بيئة اختبار للمطورين (Sandbox)؛ تحليلات متقدمة للأداء وإعداد الميزانيات؛ امتثال وحماية وفق معايير ساما والهيئة الوطنية للأمن السيبراني؛ وإدارة الصلاحيات والموافقات (Consent Management).",
      "tokens_est": 95
    },
    {
      "id": "xhub_why_ar",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "XHUB – لماذا؟",
      "lang": "ar",
      "text": "لماذا XHUB؟ نافذة واحدة للوصول إلى عدة بنوك؛ تسريع عمليات الربط والتكامل؛ تقليل تكاليف التطوير والصيانة؛ أمان وامتثال مدمج بمعايير دولية، مما يختصر الوقت ويعزز جودة التكامل.",
      "tokens_est": 70
    },
    {
      "id": "shafafiya_chunk1",
      "source": "بروشور شفافية (9).pdf",
      "page": "1",
      "section": "مقدمة",
      "lang": "ar",
      "text": "شفافية: منصة محاسبية سحابية متكاملة تتيح للجمعيات غير الربحية إدارة أعمالها المالية بسهولة، متوافقة مع معايير الحوكمة المعتمدة. يقدم فريق متخصص دعمًا محاسبيًا متواصلًا، تدريبًا مخصصًا لرفع الوعي المالي، ونظام تدقيق آلي يضمن بيانات دقيقة. المنصة تغني عن الإكسل عبر أدوات محاسبية متكاملة مع إثباتات ولوحة معلومات لحظية.",
      "tokens_est": 140
    },
    {
      "id": "shafafiya_chunk2",
      "source": "بروشور شفافية (9).pdf",
      "page": "2",
      "section": "المزايا الرئيسية",
      "lang": "ar",
      "text": "مزايا شفافية: - أمان بيانات متقدم - عدد غير محدود من المستخدمين - تكامل API مع الأنظمة الأخرى - دعم محاسبي فعال - إدارة التبرعات وتحليل مصادرها - متابعة الأداء المالي عبر لوحة معلومات.",
      "tokens_est": 110
    },
    {
      "id": "shafafiya_chunk3",
      "source": "بروشور شفافية (9).pdf",
      "page": "3",
      "section": "الخصائص الفنية",
      "lang": "ar",
      "text": "الخصائص الفنية: - إدارة العمليات المالية وفق الشجرة المحاسبية - تسجيل القيود واسترجاع البيانات بسهولة - إعداد تقارير شهرية، ربع سنوية وسنوية - قوائم مالية جاهزة للمراجعة الخارجية - ربط مع هيئة الزكاة والضريبة والجمارك - تقارير مالية دقيقة لتحقيق الشفافية.",
      "tokens_est": 130
    },
    {
      "id": "shafafiya_chunk4",
      "source": "بروشور شفافية (9).pdf",
      "page": "4",
      "section": "الخدمات الأساسية",
      "lang": "ar",
      "text": "الخدمات الأساسية: - التدريب والتمكين (بناء الشجرة المحاسبية، إعداد الإقرارات الضريبية، تمكين مجلس الإدارة، تدريب المدير التنفيذي) - إعداد الموازنات - لوحة تحكم سهلة - حماية البيانات - مؤشرات الأداء - اعتماد المصاريف - الدعم الفني - ربط مع الحسابات البنكية - صلاحيات المراجع القانوني - محفظة تشغيلية - نظام مراسلات داخلية - الحوكمة المالية.",
      "tokens_est": 150
    },
    {
      "id": "amalak_overview_ar",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "أعمالك – نظرة عامة",
      "lang": "ar",
      "text": "أعمالك: منصة موجّهة لدعم الشركات والمؤسسات الصغيرة والمتوسطة عبر تبسيط الإدارة المالية وتحسين الامتثال وتقليل التعقيدات الإدارية. تساعد على متابعة العمليات المالية اليومية، وترصد الأداء وتدعم اتخاذ القرارات. الجمهور المستهدف: أصحاب الأعمال، الشركات الناشئة، والمنشآت الصغيرة والمتوسطة.",
      "tokens_est": 95
    },
    {
      "id": "services_only",
      "source": "manual_entry",
      "page": "1",
      "section": "الخدمات",
      "lang": "ar",
      "text": "الخدمات التي نقدمها في سين تربيع: • الحوكمة والمخاطر والامتثال (GRC) • الذكاء الاصطناعي والبيانات • هندسة البيانات وتحليل الأعمال • الأمن السيبراني"
    },
    {
      "id": "products_overview_ar",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "المنتجات",
      "lang": "ar",
      "text": "المنتجات التي نقدمها في سين تربيع: • ريالك • شفافية • أعمالك • إكس لاب (XLAB) • إكس هب (XHUB)"
    },
    {
      "id": "contact_info",
      "source": "manual_entry",
      "page": "1",
      "section": "اتصل بنا / Contact Us",
      "lang": "ar-en",
      "text": "اتصل بنا | تواصل معنا | رقم التواصل | البريد الإلكتروني | الهاتف | الجوال | واتساب | المراسلة. \nيمكنك التواصل معنا مباشرة عبر البريد الإلكتروني: info2xsquare.sa أو الهاتف/واتساب: +966552323862. نحن هنا لخدمتكم والإجابة على استفساراتكم حول منتجاتنا وخدماتنا. \n---\nContact us | Get in touch | Contact number | Email | Phone | WhatsApp | Support. \nYou can reach us directly via email: info2xsquare.sa or phone/WhatsApp: +966552323862. The Seen Tarbi team is happy to help and answer any questions about our products and services."
    },
    {
      "id": "amalak_features_v13",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "أعمالك – المزايا الرئيسية",
      "lang": "ar",
      "text": "المزايا الرئيسية في أعمالك: - تبسيط الإدارة المالية والتشغيلية اليومية. - لوحات معلومات لحظية لمراقبة التدفقات النقدية والأداء. - تقارير جاهزة تساعد الإدارة في اتخاذ القرارات. - صلاحيات مرنة للمستخدمين وإدارة الأدوار. - تكامل عبر واجهات برمجة التطبيقات (API) مع الأنظمة الداخلية والخارجية.",
      "tokens_est": 110
    },
    {
      "id": "amalak_modules_v13",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "أعمالك – الوحدات والوظائف",
      "lang": "ar",
      "text": "الوحدات المتاحة: 1) الحسابات والدفاتر؛ 2) الفواتير والمدفوعات؛ 3) إدارة النفقات والمشتريات؛ 4) إدارة الأصول والمستودعات؛ 5) التقارير المالية والمؤشرات؛ 6) صلاحيات وموافقات سير العمل. كل وحدة قابلة للتهيئة بما يناسب حجم النشاط واحتياجاته.",
      "tokens_est": 115
    },
    {
      "id": "amalak_audience_v13",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "أعمالك – المستفيدون والفوائد",
      "lang": "ar",
      "text": "الفئات المستفيدة: أصحاب الأعمال، الشركات الناشئة، المنشآت الصغيرة والمتوسطة، الفرق المالية والتشغيلية. الفوائد: تقليل العمل اليدوي والأخطاء، تسريع التقفيل المالي، رؤية موحّدة للأداء، تعزيز الامتثال والحوكمة، وتقارير قابلة للمراجعة الخارجية.",
      "tokens_est": 110
    },
    {
      "id": "amalak_impl_support_v13",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "أعمالك – التنفيذ والدعم",
      "lang": "ar",
      "text": "رحلة التنفيذ: تحليل المتطلبات وتهيئة الوحدات والتكاملات، ثم تجريب محدود وتدريب الفريق، يتبعها إطلاق كامل ودعم ما بعد الإطلاق. يوفّر فريق سين تربيع إرشادًا تشغيليًا وتقنيًا وتحديثات مستمرة وفق أفضل الممارسات.",
      "tokens_est": 100
    },
    {
      "id": "amalak_faq_v13",
      "source": "website_screenshots_manual",
      "page": "1",
      "section": "أعمالك – أسئلة شائعة مختصرة",
      "lang": "ar",
      "text": "هل أعمالك مناسب لنشاطي؟ نعم، صُمّم ليلائم احتياجات المنشآت الصغيرة والمتوسطة مع قابلية التوسع. هل يدعم التكامل البنكي؟ يدعم تكاملات عبر API ولوحات متابعة للتدفقات. هل يوفر تقارير جاهزة؟ نعم، تتوفر تقارير معيارية وقابلة للتخصيص.",
      "tokens_est": 95
    },
    {
      "id": "services_en",
      "source": "manual_entry",
      "page": "1",
      "section": "Services",
      "lang": "en",
      "text": "Seen Tarbi offers several professional services: • Governance, Risk and Compliance (GRC) • Artificial Intelligence and Data Solutions • Data Engineering and Business Analytics • Cybersecurity consulting and implementation.",
      "tokens_est": 80
    },
    {
      "id": "products_en",
      "source": "manual_entry",
      "page": "1",
      "section": "Products",
      "lang": "en",
      "text": "Seen Tarbi provides innovative financial technology products: • Riyalak App – a savings and awareness platform • Shafafiya – a cloud accounting platform for non-profits • Amalak – business management for SMEs • XLAB – fintech innovation lab • XHUB – open banking data aggregation hub.",
      "tokens_est": 95
    },
    {
      "id": "riyalak_en",
      "source": "manual_entry",
      "page": "1",
      "section": "Riyalak App",
      "lang": "en",
      "text": "Riyalak is a mobile app designed to encourage saving and build sustainable financial habits. It uses psychology, behavior, and technology to raise awareness, classify expenses, and provide smart recommendations. The app aligns with Vision 2030 by promoting savings culture, family stability, and productivity.",
      "tokens_est": 95
    },
    {
      "id": "openbanking_en",
      "source": "manual_entry",
      "page": "1",
      "section": "Open Banking",
      "lang": "en",
      "text": "Open Banking enables you to connect all your bank accounts with licensed apps such as Riyalak. Benefits include: unified account view, automated expense categorization, smart financial recommendations, and full control with secure consent, aligned with Saudi Central Bank (SAMA) standards.",
      "tokens_est": 90
    },
    {
      "id": "shafafiya_en",
      "source": "manual_entry",
      "page": "1",
      "section": "Shafafiya",
      "lang": "en",
      "text": "Shafafiya is a cloud-based accounting platform for non-profit organizations. It simplifies financial management, ensures compliance with governance standards, offers unlimited users, API integrations, donation tracking, financial dashboards, training, and automated auditing for accurate reporting.",
      "tokens_est": 90
    },
    {
      "id": "amalak_en",
      "source": "manual_entry",
      "page": "1",
      "section": "Amalak Platform",
      "lang": "en",
      "text": "Amalak is a platform designed to support SMEs by simplifying financial administration, improving compliance, and reducing operational complexity. It includes modules for accounts, invoicing, expenses, assets, reporting, and workflow approvals.",
      "tokens_est": 85
    },
    {
      "id": "xlab_en",
      "source": "manual_entry",
      "page": "1",
      "section": "XLAB",
      "lang": "en",
      "text": "XLAB is Seen Tarbi’s fintech innovation lab. It provides a safe sandbox for developers and companies to test financial solutions with synthetic data, supporting AI applications such as fraud detection, analytics, and risk modeling.",
      "tokens_est": 80
    },
    {
      "id": "xhub_en",
      "source": "manual_entry",
      "page": "1",
      "section": "XHUB",
      "lang": "en",
      "text": "XHUB is a centralized data aggregation hub connecting banks, fintechs, and businesses via APIs. It enables unified, secure, and standardized access to financial data, supports developer sandboxes, advanced analytics, and compliance with SAMA standards.",
      "tokens_est": 85
    },
    {
      "id": "aboutus_en",
      "source": "manual_entry",
      "page": "1",
      "section": "About Us",
      "lang": "en",
      "text": "Seen Tarbi is a financial technology company that develops innovative solutions to enhance financial awareness and stability. Our portfolio includes Riyalak, Shafafiya, Amalak, XLAB, and XHUB. We align with Vision 2030 by empowering individuals, businesses, and institutions with modern fintech tools.",
      "tokens_est": 90
    }
  ]
}